Revit.GeometryConversion.GeometryObjectConverter.Convert(Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.Reference)
Convert a GeometryObject to an applicable ProtoGeometry type.
geom:
reference:
Returns: A Geometry type.  Null if there's no suitable conversion.